Repository: Splact/stackup
Catalog: app/locales/*.po
Languages: it

source: React Boilerplate 404 page
it: Pagina 404 di React Boilerplate

source: Page not found
it: Pagina non trovata

source: Redux Saga example
it: Esempio di Redux Saga

source: Redux Saga example against a user-fetch
it: Esempio di Redux Saga con user-fetch

source: With the following interface you can try to different type of sagas.
it: Con la seguente interfaccia puoi provare differenti tipi di saga.

source: The first one ("Fetch user") is based on a takeLatest watcher, this means that only the last action will be processed, the older ones will be cancelled.
it: Il primo tipo di saga ("Fetch utente") è basato sul watcher takeLatest, questo significa che solo l’ultima azione sarà processata, tutte le altre saranno cancellate.

source: The second type of saga ("Fetch User on channel") works on a channel with three slots, this way only if there is a free slot an action will be processed, the other ones will be queued.
it: Il secondo tipo si saga ("Fetch Utente su channel”) è basato su un channel con tre slot, in questo modo solo se c’è spazio nel canale una azione può essere processata, alternativamente questa viene messa in coda.

source: Loading...
it: Caricamento…

source: No pending requests.
it: Nessuna richiesta in elaborazione.

source: Name
it: Nome

source: Phone
it: Telefono

source: Website
it: Sito web

source: Is a fetching on a channel...
it: Fetching su channel…

source: Pending requests
it: Richieste in elaborazione

source: Requests in queue
it: Richieste in coda

source: Refused requests
it: Richieste rifiutate

source: Redux Storage example
it: Esempio di Redux Storage

source: Redux Storage example on localforage
it: Esempio di Redux Storage su localforage

source: Welcome
it: Benvenuto

source: React Boilerplate welcome page
it: Pagina di benvenuto di React Boilerplate

source: Use the nav bar to get in working examples of features provided by this boilerplate.
it: Usa la barra di navigazione per accedere agli esempi delle caratteristiche di questo boilerplate.

source: The page {{codePath}} was not found.
it: La pagina {{codePath}} non esiste.

source: When an action is fired, after a debounce time of 2s (specified in {{codePath}}), a {{codeAction}} action will save the updated state on localstorage.
it: Quando un’azione è lanciata, dopo un tempo di debounce di 2s (definito in {{codePath}}), una azione {{codeAction}} salverà lo stato aggiornato su localstorage.

source: See it in action on {{link}}.
it: Osservalo in azione su {{link}}.
